{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 252, 252, 3], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "name": "conv2d_3", "bias_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "units": 64}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.1, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "units": 3}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "softmax"}}]}, "keras_version": "2.2.4"}